app/views/users/show.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 95]]
SELECT COUNT(*) FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 92]]
---
    <% end %>
    <% if @user.lists.size > 0 %>