app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    # assign user to @list
    @list.user = current_user
    # select scene by scene id
    @scene = Scene.find_by_id(params[:scene_id])
    # if checkbox is true, add scene to list
    if @scene
      # assign scene to @list
      @list.scenes << @scene
---
INSERT INTO "lists" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["description", ""], ["user_id", 157], ["created_at", "2016-02-19 23:50:01.678630"], ["updated_at", "2016-02-19 23:50:01.678630"]]

  def show
    @list = List.find_by_id(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 10]]

  def edit
    @list = List.find_by_id(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 122]]

  def update
    @list = List.find_by_id(params[:id])
    if current_user == @list.user
      @scenes = []
      @flash_notices = []
      @scene_ids = params[:scene_id]
      if @scene_ids
        @scene_ids.each do |l|
          if l.empty? do |a|
            @scene_ids.delete(a)
          end
          else
            @scene = Scene.find_by_id(l)
            title = @scene.title
            @listscene = ListScene.where({scene_id: @scene.id, list_id: @list.id})
            ListScene.destroy(@listscene)
            @flash_notices << title
          end
        end
      end
      if @list.update_attributes(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 122]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 113]]
UPDATE "lists" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "lists"."id" = $4  [["title", "Bullitt Walk"], ["description", "Take a trip around SF and checkout all these real hot scenes form bullitt!!"], ["updated_at", "2016-02-19 22:46:26.118073"], ["id", 122]]

  def destroy
    @list = List.find_by_id(params[:id])
    if current_user == @list.user
      @list.destroy
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 123]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 123]]