app/controllers/scenes_controller.rb

  def index
    @listscene = ListScene.new
    @scenes = Scene.all
---
SELECT "scenes".* FROM "scenes"

  def show
    @listscene = ListScene.new
    @scene = Scene.find_by_id(params[:id])
---
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = $1 LIMIT 1  [["id", 1]]