app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "description", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "l"], ["description", "l"], ["email", "l"], ["created_at", "2016-02-19 20:06:10.542915"], ["updated_at", "2016-02-19 20:06:10.542915"]]

  def update
    @user = User.find_by_id(params[:id])
    if current_user == @user
      if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 113]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Waffle"], ["updated_at", "2016-02-19 22:52:02.238907"], ["id", 113]]

  def destroy
    @user = User.find_by_id(params[:id])
    if current_user == @user
      @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 134]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 134]]